import { z } from "zod";

const categoryCdList = [
  "001",
  "002",
  "003",
  "004",
  "005",
  "006",
  "007",
  "008",
  "009",
  "010",
  "011",
  "012",
  "013",
  "014",
  "015",
  "016",
  "017",
  "018",
  "019",
  "020",
  "021",
  "022",
  "023",
  "024",
  "025",
  "026",
  "027",
  "028",
  "029",
  "030",
  "031",
  "032",
  "033",
  "034",
  "035",
  "036",
  "037",
  "038",
  "039",
  "040",
  "041",
  "042",
  "043",
  "044",
  "045",
  "046",
  "047",
  "048",
  "049",
  "050",
] as const;

const categoryCdLabelList = [
  "憲法",
  "刑事",
  "財務通則",
  "水産業",
  "観光",
  "国会",
  "警察",
  "国有財産",
  "鉱業",
  "郵務",
  "行政組織",
  "消防",
  "国税",
  "工業",
  "電気通信",
  "国家公務員",
  "国土開発",
  "事業",
  "商業",
  "労働",
  "行政手続",
  "土地",
  "国債",
  "金融・保険",
  "環境保全",
  "統計",
  "都市計画",
  "教育",
  "外国為替・貿易",
  "厚生",
  "地方自治",
  "道路",
  "文化",
  "陸運",
  "社会福祉",
  "地方財政",
  "河川",
  "産業通則",
  "海運",
  "社会保険",
  "司法",
  "災害対策",
  "農業",
  "航空",
  "防衛",
  "民事",
  "建築・住宅",
  "林業",
  "貨物運送",
  "外事",
] as const;

export const categoryCdLabelMap = categoryCdList.map((categoryCd, index) => ({
  label: categoryCdLabelList[index],
  value: categoryCd,
}));

/**
 * 事項別分類コードを指す。
 * - 001 - 憲法
 * - 002 - 刑事
 * - 003 - 財務通則
 * - 004 - 水産業
 * - 005 - 観光
 * - 006 - 国会
 * - 007 - 警察
 * - 008 - 国有財産
 * - 009 - 鉱業
 * - 010 - 郵務
 * - 011 - 行政組織
 * - 012 - 消防
 * - 013 - 国税
 * - 014 - 工業
 * - 015 - 電気通信
 * - 016 - 国家公務員
 * - 017 - 国土開発
 * - 018 - 事業
 * - 019 - 商業
 * - 020 - 労働
 * - 021 - 行政手続
 * - 022 - 土地
 * - 023 - 国債
 * - 024 - 金融・保険
 * - 025 - 環境保全
 * - 026 - 統計
 * - 027 - 都市計画
 * - 028 - 教育
 * - 029 - 外国為替・貿易
 * - 030 - 厚生
 * - 031 - 地方自治
 * - 032 - 道路
 * - 033 - 文化
 * - 034 - 陸運
 * - 035 - 社会福祉
 * - 036 - 地方財政
 * - 037 - 河川
 * - 038 - 産業通則
 * - 039 - 海運
 * - 040 - 社会保険
 * - 041 - 司法
 * - 042 - 災害対策
 * - 043 - 農業
 * - 044 - 航空
 * - 045 - 防衛
 * - 046 - 民事
 * - 047 - 建築・住宅
 * - 048 - 林業
 * - 049 - 貨物運送
 * - 050 - 外事
 */
export const CategoryCdSchema = z.enum(categoryCdList);

export type CategoryCdType = z.infer<typeof CategoryCdSchema>;
